app/views/tasks/index.html.erb

    <h1 class="text-2xl font-bold text-gray-900">My Tasks</h1>
    <p class="text-sm text-gray-500"><%= @tasks.count %> <%= "task".pluralize(@tasks.count) %></p>
---
SELECT "tasks".* FROM "tasks" ORDER BY "tasks"."created_at" DESC
SELECT COUNT(*) FROM "tasks"