app/controllers/tasks_controller.rb

  def index
    @tasks = Task.newest_first
    @tasks = @tasks.by_priority(params[:priority]) if params[:priority].present?
---
SELECT "tasks".* FROM "tasks" ORDER BY "tasks"."created_at" DESC
SELECT 1 AS one FROM "tasks" LIMIT ?  [["LIMIT", 1]]

  def create
    @task = Task.new(task_params)

    if @task.save
---
INSERT INTO "tasks" ("title", "description", "due_date", "completed", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?) RETURNING "id"  [["title", "New task"], ["description", "Details"], ["due_date", "2026-04-01"], ["completed", 0], ["created_at", "2026-02-17 07:01:48.214891"], ["updated_at", "2026-02-17 07:01:48.214891"]]

  def update
    if @task.update(task_params)
---
UPDATE "tasks" SET "title" = ?, "updated_at" = ? WHERE "tasks"."id" = ?  [["title", "Updated title"], ["updated_at", "2026-02-17 07:01:47.993764"], ["id", 1]]

  def destroy
    @task.destroy!
---
DELETE FROM "tasks" WHERE "tasks"."id" = ?  [["id", 1]]